In [12]:
import pandas as pd
import numpy as np

In [13]:
people_dic={'first mame':['marc', 'julia', 'alex','John', 'Thomas', 'david','Mary', 'Sarah', 'Margaret', 'betty',],
            'last name': ['smith', 'johnson','williams', 'brown','miller','Harris','clark','campbell','Mitchell','carter',],
           'date of birth':['01/10/1973','10/03/1977','07/01/1984','08/28/1968','12/11/1990','03/21/1985','07/06/1990','02/11/2001','06/19/1989','04/22/1993'],
           'state':['fl','ca','ny','co','ga','hi',np.nan,'tx','or',np.nan],
           'occupation': ['Engineer','Accountant','Healthcare worker','Surgeon','Dentist','Scientist','Journalist','Nurse','Lawyer','it prof.']}

In [14]:
people = pd.DataFrame(people_dic)

In [ ]:
people.isnull()  # checking missing values
people.notnull()  # checking non-missing values
people.isnull().any()  # checking non-missing values
people.isnull().values.any()  # only want to know if there are any missing values
people.notnull().sum()  # knowling number of non-missing values for each variable
people.isnull().sum().sum()  # knowing how many missing values in the data
people["state"].isnull().values.any()  # only want to know if there are any missing values in CNN
people["occupation"].isnull().values.any()
people["email"].isnull().sum()  # return the number of missing values in TO_ST

In [11]:
people.isnull().any()

first mame       False
last name        False
date of birth    False
state             True
occupation       False
dtype: bool

In [4]:
people['email']=np.nan

In [5]:
people['test']=np.nan

In [6]:
people.head(3)

  first mame last name date of birth state         occupation  email  test
0       marc     smith    01/10/1973    fl           Engineer    NaN   NaN
1      julia   johnson    10/03/1977    ca         Accountant    NaN   NaN
2       alex  williams    07/01/1984    ny  Healthcare worker    NaN   NaN

In [7]:
people['test'].replace(np.nan, 0, inplace=True)

In [8]:
people.head(3)

  first mame last name date of birth state         occupation  email  test
0       marc     smith    01/10/1973    fl           Engineer    NaN   0.0
1      julia   johnson    10/03/1977    ca         Accountant    NaN   0.0
2       alex  williams    07/01/1984    ny  Healthcare worker    NaN   0.0

In [9]:
people1=people['state'].dropna(how='all')

In [10]:
people1

0    fl
1    ca
2    ny
3    co
4    ga
5    hi
7    tx
8    or
Name: state, dtype: object

In [11]:
people.dropna(axis=1)

  first mame last name date of birth         occupation  test
0       marc     smith    01/10/1973           Engineer   0.0
1      julia   johnson    10/03/1977         Accountant   0.0
2       alex  williams    07/01/1984  Healthcare worker   0.0
3       John     brown    08/28/1968            Surgeon   0.0
4     Thomas    miller    12/11/1990            Dentist   0.0
5      david    Harris    03/21/1985          Scientist   0.0
6       Mary     clark    07/06/1990         Journalist   0.0
7      Sarah  campbell    02/11/2001              Nurse   0.0
8   Margaret  Mitchell    06/19/1989             Lawyer   0.0
9      betty    carter    04/22/1993           it prof.   0.0

In [12]:
people.dropna(subset=['test'], how='all')

  first mame last name date of birth state         occupation  email  test
0       marc     smith    01/10/1973    fl           Engineer    NaN   0.0
1      julia   johnson    10/03/1977    ca         Accountant    NaN   0.0
2       alex  williams    07/01/1984    ny  Healthcare worker    NaN   0.0
3       John     brown    08/28/1968    co            Surgeon    NaN   0.0
4     Thomas    miller    12/11/1990    ga            Dentist    NaN   0.0
5      david    Harris    03/21/1985    hi          Scientist    NaN   0.0
6       Mary     clark    07/06/1990   NaN         Journalist    NaN   0.0
7      Sarah  campbell    02/11/2001    tx              Nurse    NaN   0.0
8   Margaret  Mitchell    06/19/1989    or             Lawyer    NaN   0.0
9      betty    carter    04/22/1993   NaN           it prof.    NaN   0.0